#include <stdio.h>
#include <locale.h>

int main()
{setlocale(LC_CTYPE, "ukr");
   printf("Введіть номер маршруту трамваю та дiзнайтесь початкову та кiнцеву зупинку: \n");
   printf("|1| ~ |2| ~ |3| ~ |4| ~ |5| ~ |6| ~ |8| ~ |9| ~ |11| \n");

   int marshrut = 0;
   scanf( "%d", &marshrut);

    switch(marshrut)
    {
         case 1: printf("Початкова: «Держунiверситет» \nКiнцева: «Училище №15» \n ");
        break;
         case 2: printf("Початкова: «Держунiверситет» \nКiнцева: «Завод Гравiтон»   \n ");
        break;
         case 3: printf("Початкова: «Завод Кварц»  \nКiнцева: «Дрiжджзавод» \n ");
        break;
         case 4: printf("Початкова: «Держунiверситет»  \nКiнцева: «Музей народної архiтектури та побуту»  \n ");
        break;
         case 5: printf("Початкова: «Калинiвський ринок»  \nКiнцева: «вулиця Пiвденно-Кiльцева»  \n ");
        break;
        case 6: printf("Початкова: «Соборна площа»  \nКiнцева: «Завод Кварц»  \n ");
        break;
         case 8: printf("Початкова: «Держунiверситет»  \nКiнцева: «вулиця Південно-Кільцевa»  \n ");
        break;
        case 9: printf("Початкова: «Соборна площа»  \nКiнцева: «Завод Гравiтон»  \n ");
        break;
        case 11: printf("Початкова: «Cадгора»  \nКiнцева: «Училище №15»  \n ");
        break;

        default:  printf("Такого маршруту немає :( \nВведiть iнший номер маршруту! \n");
                break;
    }

        printf("\nДякуємо, що скористалися нашою послугою!:) \n");

     return 0;
}
